package com.demo.progresstests.exam2.exercies17.exercies1714;
/*
Напишите метод, который принимает в качестве параметра два целых
числа и возвращает среднее арифметическое сумм цифр в этих числах.
 */

public class Exercies17_14 {
    void average(int num1, int num2) {
        System.out.println((num1 + num2) / 2);
    }


}
