package com.demo.progresstests.exam2.exercies17.exercies172;
/*
int а, b, f;
double c, d;
boolean е;

Также даны заголовки методов:
static double test1(double х, int у, boolean z)
static void test2(double х, int у, boolean z)

Для каждого вызова метода, приведенного ниже в таблице, укажите,
сделан он с ошибкой или без ошибки; обоснуйте свой ответ:

------------------------------------------------------------------------------
|   a=test1(5.3, а, е);                 | false, a-n int e, isk veradarcnox typen double |
------------------------------------------------------------------------------
|   d=test1(1,2,true);                  | treue erkisi tipe double e         |
------------------------------------------------------------------------------
|   if(test1(d, Ь, e) == f) {           |         false                      |
|       test2(d, с + Ь, е);             |   tarber type en                   |
|   }                                   |      double != int                 |
------------------------------------------------------------------------------
|   f=test2(c, 5, е);                   |            false                   | // test1-i het eyi sax xarnel
------------------------------------------------------------------------------
|   c=test1(c, d, false);               |           false                   |
------------------------------------------------------------------------------
|  System.out.println(test1(1,1,f>d));  |     true                           |
------------------------------------------------------------------------------
| System.out.println(test2(1,1,true));  |     false                          |
------------------------------------------------------------------------------

 */

public class Exercies17_2 {
}
