package com.demo.progresstests.exam2.exercies17.exercies172;
/*
int а, b, f;
double d;
boolean е;

Также даны заголовки методов:
static double test1(double х, int у, boolean z)
static void test2(double х, int у, boolean z)

Для каждого вызова метода, приведенного ниже в таблице, укажите,
сделан он с ошибкой или без ошибки; обоснуйте свой ответ:

------------------------------------------------------------------------------
|   a=test1(S.3, а, е);                 | false,                             |
------------------------------------------------------------------------------
|   d=test1(1,2,true);                  |           treue                    |
------------------------------------------------------------------------------
|   if(test1(d, Ь, e) == f) {           |         false                      |
|       test2(d, с + Ь, е);             |                                    |
|   }                                   |                                    |
------------------------------------------------------------------------------
|   f=test2(c, 5, е);                   |            true                    |
------------------------------------------------------------------------------
|   c=test1(c, d, false);               |           true                     |
------------------------------------------------------------------------------
|  System.out.println(test1(1,1,f>d));  |      false                         |
------------------------------------------------------------------------------
| System.out.println(test2(1,1,true));  |      true                          |
------------------------------------------------------------------------------

 */

public class Exercies17_2 {
}
