package com.demo.progresstests.exam1.exercies11;
/*
Даны описания заголовков циклов. Напишите эти заголовки на языке Java.

1. Цикл выполняется 17 раз, начальное значение переменной-счетчика равно 12.

if (int i = 12; i < 29; i++);   // chisht@ vorna miangamic gres 28 te i<12+17; ete haves chunes hashves: miangamic gres

2. Цикл выполняется 7 раз, конечное значение переменной-счетчика равно 45.

if (int i = 39; i < 46; i++)

3. Цикл выполняется 300 раз, начальное значение переменной-счетчика равно 1,
   ее значение должно увеличиваться каждый раз на 5.

  int (int i = 1; i < 1500; i+=5)

4. Цикл выполняется 20 раз, начальное значение переменной-счетчика равно 1,
   ее значение должно увеличиваться каждый раз на 10.

   for (int i = 1; i < 200; i+=10);

5. Цикл выполняется 300 раз, конечное значение переменной-счетчика равно 1,
   ее значение должно уменьшаться каждый раз на 1.

   if (int i = 299; i>0; i--);

6. Цикл выполняется 25 раз, конечное значение переменной-счетчика равно 1,
   ее значение должно уменьшаться каждый раз на 7.

   if (int i = 174; i > 0; i--);
 */

public class Exercies11_1 {


}
