package com.demo.progresstests.exercies8;
/*
Перед вами фрагмент программы, включающий два условных оператора.
Заполните таблицы в соответствии с исполнением операторов.
    if(a * a != b) {
        x = a / 2 + b;
    } else {
        x = b / 2 + a;
    }

    if(x < 15 ) {
        System.out.println("X=" + x);
    } else {
        System.out.println(x);
    }

Таблица 1
---------------------------------------------------------------------
|   a       |   10  |   -5  |   12  |   6   |   7   |   14  |   9   |
---------------------------------------------------------------------
|   b       |   11  |   10  |   6   |   12  |   7   |   14  |   18  |
---------------------------------------------------------------------
|   x       |   16  |   8   |   12  |  15   |  10   |  21   |   22  |
---------------------------------------------------------------------
| На экране |   16  | X = 8 | X = 12|  15   | X = 10|  21   |   22  |
---------------------------------------------------------------------

Таблица 2
---------------------------------------------------------------------
|   a       |   10  | - 40  | false |   6   |   7   |   0   |   9   |
---------------------------------------------------------------------
|   b       |   21  |   10  | false |  -3   | false |   14  |   5   |
---------------------------------------------------------------------
|   x       |   26  |   -10 |  x<15 |   0   |  X=10 |   14  |   9   |
---------------------------------------------------------------------
| На экране |   26  | X=-10 |  X=30 |  X=0  |   10  | X = 14| X = 9 |
---------------------------------------------------------------------
// false nra hamar vor if-i paymanum  erb x<15 nor tpi X=, en myusn el x>=15 nor miangamic arjeq@
 */

public class Exercies8_3 {
    public static void main(String[] args) {
        Exercies8_3(9, 5);
    }

    private static void Exercies8_3(int a, int b) {
        int x;
        if (a * a != b) {
            x = a / 2 + b;
        } else {
            x = b / 2 + a;
        }
        if (x < 15) {
            System.out.println("X=" + x);
        } else {
            System.out.println(x);
        }
    }
}
