package com.demo.progresstests.exercies8;
/*
8.1
Дан оператор выбора:
    if(x / 10 >= 5) {
        t = 20;
    } else {
        t = 0
    }

1. Каким будет, после выполнения оператора, значение переменной t,
   если значение переменной х равно:
                                       1.1) 59      t = 20
                                       1.2) 8       t = 0
                                       1.3) 21      t = 0
2. Каким было значение переменной х, если после выполнения оператора
   значение переменной t равно: 20
                                       2.1) 20    x >= 50
                                       2.1) 0     x < 50
   Если есть несколько вариантов ответа, достаточно привести один из них.
 */

public class Exercies8_1 {
}
