package com.demo.progresstests.exercies15;
/*
Напишите класс, который принимает с клавиатуры целое число и выводит на экран:
• в первой строке - все четные (по месту) цифры этого числа, через пробел;
• во второй строке - все нечетные (по месту) цифры этого числа, через пробел.
Например, для числа 765873 в первой строке будет выведена серия 6 8 3, а во второй строке - 7 5 7.
 */

import java.util.Scanner;

public class Exercies15_24 {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);

        System.out.println("number");
        int num = scanner.nextInt();

        while (true){
            System.out.println();
        }
    }
}
