package com.demo.progresstests.exam1.exercies1;
/*
Напишите фрагмент класса, который будет присваивать значение 7.5 переменной х,
а затем будет присваивать переменным а и Ь значения вдвое и второе (соответственно) большие,
чем значение переменной х.
 */

public class Exercise1_5 {
    public static void main(String[] args) {
        double x = 7.5;
        // double a = 2 * x;
        // double b = 3 * x;
        // 2 dzevov el grel em
        double a;
        double b;
        a = 2 * x;
        b = 3 * x;
        System.out.println(" a = " + a);
        System.out.println(" b = " + b);
    }
}
