package com.demo.progresstests.exam1.exercies1;
/*
1.3
Перед вами словесные описания объявления и инициализации переменных.
Запишите их в правилах языка Java - в разных допустимых вариантах.

-- Переменная х (типа «простое целое») получает значение 16.
-- Переменные х и t относятся к типу «простое целое», при этом значение переменной х равно - 2.
-- Переменные t и f относятся к «вещественному типу», при этом переменная t имеет значение 5.5,
    а значение переменной f в 10 больше значения переменной t.
 */

public class Exercise1_3 {
    public static void main(String[] args) {

        // 1    int x = 16;

        // 2
        int x = -2;
        int t;

    }

    private static void EExercise1_3() {
        double t = 5.5;
        double f = t + 10;
        System.out.println(" f = " + f);

    }
}
