package com.demo.progresstests.exam1.exercies1;
/*
Напишите фрагмент класса (группу команд), который будет присваивать значения 5 и 9 двум переменным,
а затем третья переменная будет получать значение, равное сумме значений первых двух переменных.
 */

public class Exercise1_4 {
    public static void main(String[] args) {
        int a = 5;
        int b = 9;
        int c = a + b;
        System.out.println(" c = " + c);
    }
}
