package com.demo.progresstests.exercies5;
/*
Напишите соответствующие выражения на языке Java для словесных описаний,
приведенных в таблице (имена для переменных выберите самостоятельно):

Словесное описание                          |       Выражение на языке Java
Значение переменной больше 90               |       i > 90;
Оценка - не меньше 75                       |       j >= 75;
Разница между значениями отлична от О       |       a - b != 0;
Значение не превышает 200                   |       m - n <= 200;
Значение хотя бы не больше 120              |       k <= 120;
Значение одной переменной равно сум-        |       x = y + z;
ме значений двух других переменных          |
 */


public class Exercies5_2 {

}
