package com.demo.progresstests.exam1.exercies18;
/*
Укажите, какие значения будет содержать массив, после выполнения следующего блока
(случайное число, генерируемое в блоке, выберите самостоятельно в соответствии
с указанными в команде границами, используйте таблицу трассировки):

int x = (int) (Math.random() * 99 + 1);
for(int i = O; i < n; i++) {
    a[i] = x;
    х = х + х % 10;
}
 */

public class Exercies18_6 {
    //int x = (int) (Math.random() * 99 + 1);
    // x = 62;

    // a[0] = 62;
    // x = 62 + 62 % 10 = 64;

    // a[1] = 64;
    // x = 64 + 64 % 10 = 68;

    // a[2] = 68;
    // x = 68 + 68 % 10 = 76;

    // a[3] = 76;
    // x = 76 + 76 % 10 = 82;

    // a[4] = 82;
    // x = 82 + 82 % 10 = 84;
}
