package com.demo.progresstests.exam1.exercies18;
/*
Укажите, какие значения будет содержать массив, после выполнения следующего блока
(случайные числа, генерируемые в блоке, выберите самостоятельно в соответствии
с указанными в команде границами, используйте таблицу трассировки):

int x = (int) (Math.random() * 1OO);
for(int i = O; i < n; i++) {
    a[i] = x;
    x = (int) (x + Math.random() * 1OO);
}
 */

public class Exercies18_7 {
    // x = 24;
    // a[0] = 24;
    // x = 24 + 13 = 37;

    // a[1] = 37;
    // x = 37 + 12; = 49;

    // a[2] = 49;
    // x = 49 + 14 = 63;

    // a[3] = 63;
    // x = 63 + 11 = 74;

    // a[4] = 74;
    // x = 74 + 25 = 99;
}
