package com.demo.progresstests.exam1.exercies18;
/*
Укажите, какие значения будет содержать массив, после выполнения следующего блока
(данные, вводимые с клавиатуры, выберите самостоятельно, используйте таблицу трассировки):

for(int i = O; i < n; i++) {
    x = reader.nextInt();
    a[i] = x % 2;
}
 */

public class Exercies18_2 {

    // x = 23; a[0] = 23 % 2 = 1;
    // x = 40; a[1] = 40 % 2 = 0;
    // x = 15; a[2] = 15 % 2 = 1;
    // x = 87; a[3] = 87 % 2 = 1;
    // x = 22; a[4] = 22 % 2 = 0;
}
