package com.demo.progresstests.exam1.exercies18;
/*
Укажите, какие значения будет содержать массив, после выполнения следующего блока
(случайные числа, генерируемые в блоке, выберите самостоятельно в соответствии
с указанными в команде границами, используйте таблицу трассировки):

for(int i = O; i < n; i++) {
    x = (int) (90 * Math.random() + 10);
    a[i] = x / 10;
}
 */

public class Exercies18_4 {
    // x = 54; a[0] = 54 / 10 = 5;
    // x = 32; a[1] = 32 / 10 = 3;
    // x = 67; a[2] = 67 / 10 = 6;
    // x = 45; a[3] = 45 / 10 = 4;
    // x = 92; a[4] = 92 / 10 = 9;
}
