package com.demo.progresstests.exam1.exercies18;
/*
Укажите, какие значения будет содержать массив, после выполнения следующего блока
(используйте таблицу трассировки):

a[O] = 1;
a[1] = 1;
for(int i = 2; i < n; i++) {
    a[i] = a[i-1] + a[i-2];
}
 */

public class Exercies18_9 {
    // a[i-1] = a[2-1] = a[1];
    // a[i-2] = a[2-2] = a[0];
    // a[2] = a[1] + a[0] = 1 + 1 = 2;

    // a[i-1] = a[3-1] = a[2];
    // a[3-2] = a[3-2] = a[1];
    // a[3] = a[2] + a[1] = 2 + 1 = 3;

    // a[i-1] = a[4-1] = a[3];
    // a[i-2] = a[4-2] = a[2];
    // a[4] = a[3] - a[2] = 3 + 2 = 5;

}
