package com.demo.progresstests.exam2.exercies17.exercies171;
/*
Даны описания переменных:
double r1;
int х1,х2,b1,b2;

Также даны заголовки нескольких методов:
static int fun1(int х, double у);
static int fun2(int b);

Для каждого вызова метода, приведенного ниже в таблице, укажите,
сделан он с ошибкой или без ошибки; обоснуйте свой ответ:

------------------------------------------------------------------------------
|   x2=fun1(х14, 11/12);                |false argument@ chi kara lini popoxakan, x14 |
------------------------------------------------------------------------------
|   fun1(5,9/3);                        |          true                      |
------------------------------------------------------------------------------
|   if(fun1(7,x1) > O) {r1 = 7;}        |false, metod@ chi kara > = < lini inch vor tvic |
------------------------------------------------------------------------------
|   if(fun1(7,x1) == b1) {fun2 = 7;}    |           false                         |
------------------------------------------------------------------------------
|   b1 = fun1(fun2(b2), r1);            |              true                  |
------------------------------------------------------------------------------
|   System.out.println(fun2(xl > x2));  | false, int paramet@ chi kara boolenan argument @nduni|
------------------------------------------------------------------------------
|   System.out.println(fun2(b1 - b2));  |             treu                   |
------------------------------------------------------------------------------

 */

public class Exercies17_1 {
}
