package com.demo.progresstests.exam1.exercies15;
/*
Дан фрагмент класса:

int a=reader.nextInt();
int b=reader.nextInt();
while (а != Ь) {
    а++;
    Ь--;
}
System.out.print(a);

1. Постройте таблицу трассировки и укажите, что будет выведено на экран,
   если с клавиатуры были введены следующие значения: 7, 3.

2. Постройте таблицу трассировки и укажите, что будет выведено на экран,
   если с клавиатуры были введены следующие значения: 9, 1.

3. Приведите пример значений, вводимых с клавиатуры,
   для которых цикл никогда не завершится. Объясните свой ответ.

4. Укажите, какое изменение следует сделать в данном фрагменте,
   чтобы цикл завершался при любых значениях вводимых данных.
 */

public class Exercies15_2 {

//1. a=7;    7!=3          8!=2
//   b=3;    a=8           a=9
//           b=2           b=1
//    chi tpi vochinch
//    karj u konkret k@ngni anvrej cikli mej, qani vor i skzbane a>b u a-n an@ndhat ajox e isk b-n nvazox, misht kbavarvi
//    payman@ u ciklic durs chi ga, tpelu masin el kmorananq

//    2. nuyn verevi berac orinakov, @ngneluya anverj cikli mej

//    3. veri orinakner@

//    4.while (а < Ь) {
//        а++;
//        Ь--;
//    }
}
