package com.demo.progresstests.exercies7;
/*
«Переведите» словесные описания в команды на языке Java.

Словесное описание                              |  Команда на языке Java
----------------------------------------------------------------------------
Если значение переменной avg равно 100,         |
то выведи на экран сообщение Молодец            |
int avg = 0;
if(avg == 100){
System.out.println("abris");
}
----------------------------------------------------------------------------
Если значение переменной mark меньше 60,        |
то увеличить это значение на 10%.               |
int mark = 0;
if(mark < 60){
System.out.println(mark + mark/100 *10);
}
----------------------------------------------------------------------------
Если значение переменной one больше             |
значения переменной two, то вывести на          |
экран значение one; в противном случае          |
вывести на экран значение переменной two        |
int one = 0;
int twe = 0;
if(one > twe){
System.out.println("one");
}else {
System.out.println("twe");
}
----------------------------------------------------------------------------
Если значение переменной num больше нуля,       |
то вывести на экран сообщение 'Положительное'.  |
Если значение переменной num меньше нуля,       |
то вывести на экран сообщение 'Отрицательное'   |
int num = 0;
if (num > 0){
System.out.println("drakan");
}else if (num < 0){
System.out.println("bacasakan");
}
----------------------------------------------------------------------------
Если сумма переменных ugol1, ugol2 и ugol3      |
составляет 180, то вывести на экран             |
сообщение 'Это уrлы одноrо'треуrольника';       |
в противном случае вывести на экран сообщение   |
'Это не уrлы одноrо треуrольника'.              |
int ugol1 = 0;
int ugol2 = 0;
int ugol3 = 0;
if(ugol1 + ugol2 + ugol3 == 180){
System.out.println("mievnuyn erankyan ankyunnern en");
}else {
System.out.println("mievnuyn erankyan ankyunnern chen");
}
// stex verevum karayi haytarareyi
int ugol;
ugol = ugol1 + ugol2 + ugol3;
if(ugol == 180) .....
 */

public class Exercies7_1 {

}
