package com.demo.lesson5.homework;

public class JumpHomeWork {

    public static void main(String[] args) {

    }

    /**
     * 1. Գրել պարզ for ցիկլ ու ինչ֊որ պայմանի դեպքում դուրս գալ ցիկից․
     * 2. Գրել պարզ while ցիկլ ու ինչ֊որ պայմանի դեպքում դուրս գալ ցիկից․
     */
    private static void breakSimpleDemo() {

    }

    /**
     * 1. Գրել 2 for ցիկլ մեկը մյուսի ներսում ու ինչ֊որ պայմանի դեպքում դուրս գալ ցիկից (որ ցիկլից որ հարմարա)․
     * 2. Գրել 2 while ցիկլ մեկը մյուսի ներսում ու ինչ֊որ պայմանի դեպքում դուրս գալ ցիկից (որ ցիկլից որ հարմարա)․
     */
    private static void breakNestedDemo() {

    }

    /**
     * 1. Գրել 2 for ցիկլ մեկը մյուսի ներսում ու ինչ֊որ պայմանի դեպքում ներսի ցիկլում գրած,
     * դուրս գալ վերևի ցիկից․
     * 2. Գրել 2 while ցիկլ մեկը մյուսի ներսում ու ինչ֊որ պայմանի դեպքում ներսի ցիկլում գրած,
     * դուրս գալ վերևի ցիկից․
     */
    private static void breakGotoDemo() {

    }

    /**
     * 1. Գրել պարզ for ցիկլ ու ինչ֊որ պայմանի դեպքում բաց թողնել ցիկի տվյալ քայլը․
     * 2. Գրել պարզ while ցիկլ ու ինչ֊որ պայմանի դեպքում բաց թողնել ցիկի տվյալ քայլը․
     */
    private static void continueSimpleDemo() {

    }

    /**
     * 1. Գրել 2 for ցիկլ մեկը մյուսի ներսում ու ինչ֊որ պայմանի դեպքում
     * բաց թողնել ցիկի տվյալ քայլը (որ ցիկլում որ հարմարա)․
     * 2. Գրել 2 while ցիկլ մեկը մյուսի ներսում ու ինչ֊որ պայմանի դեպքում
     * բաց թողնել ցիկի տվյալ քայլը (որ ցիկլում որ հարմարա)․
     */
    private static void continueNestedDemo() {

    }

    /**
     * 1. Գրել 2 for ցիկլ մեկը մյուսի ներսում ու ինչ֊որ պայմանի դեպքում ներսի ցիկլում գրած,
     * բաց թողնել վերևի ցիկի տվյալ քայլը․
     * 2. Գրել 2 while ցիկլ մեկը մյուսի ներսում ու ինչ֊որ պայմանի դեպքում ներսի ցիկլում գրած,
     * բաց թողնել վերևի ցիկի տվյալ քայլը․
     */
    private static void continueGotoDemo() {

    }

    /**
     * 1. Գրել պարզ for (կամ while) ցիկլ ու ինչ֊որ պայմանի դեպքում դուրս գալ method֊ից
     */
    private static void returnSimpleԼօօպDemo() {

    }

    /**
     * 1. Գրել պարզ method (տպել օրինակ ինչ֊որ բան, կամ հաշվարկել) ու ինչ֊որ պայմանի դեպքում դուրս գալ method֊ից
     */
    private static void returnSimpleDemo() {

    }

}
