package com.demo.progresstests.exam1.exercies2;
/*
Напишите класс, который выводит на экран надпись 'Hello, World!
 */

public class Exercies2_1 {
    public static void main(String[] args) {
        System.out.println("Hello, World!");
    }
}
