package com.demo.progresstests.exam1.exercies2;
/*
Напишите класс, который выводит на экран в первой строке три знака «+»,
во второй - четыре знака «!», в третьей - два знака «?».
 */

public class Exercies2_2 {
    public static void main(String[] args) {
        System.out.println(" +  +  + ");
        System.out.println(" !  !  !  !");
        System.out.println(" ?  ? ");
    }
}
