package com.demo.progresstests.exam1.exercies9;
/*
Дано составное условие с переменными типа int: (a>lO && b>lOO)

Заполните таблицу:
---------------------------------------------------------
|   a           |   20  |   6   |   28  |   10  |   10  |
---------------------------------------------------------
|   b           |   231 |   131 |   87  |   10  |   31  |
---------------------------------------------------------
|   Значение    | true  |       |       |       |       |
|   выражения   |       | false | false | false | false |
---------------------------------------------------------
 */

public class Exercies9_1 {
}
