package com.demo.progresstests.exam1.exercies9;
/*
Дано составное условие с переменными типа int: (a>lO || b>lO)
Заполните таблицу:
---------------------------------------------------------
|   a           |   20  |   6   |   28  |   10  |   10  |
---------------------------------------------------------
|   b           |   31  |   100 |   8   |   10  |   1   |
---------------------------------------------------------
|   Значение    | true  | true  | true  |       |       |
|   выражения   |       |       |       | false | false |
---------------------------------------------------------
 */

public class Exercies9_2 {
}
