package com.demo.progresstests.exercies9;
/*
Запиши в форме, принятой в языке Java, следующие условия,
выраженные в таблице в словесной форме.

Словесная форма условия                     |           Java
------------------------------------------------------------------------
Значение переменной больше 90,              |
но меньше 10                                |

if(a>90 || a<10);

------------------------------------------------------------------------
Сумма значений двух переменных больше 100,  |
но не превышает 200                         |

int a;
int b;
int c = a+b;
if(c >100 && a<=200)

------------------------------------------------------------------------
Значение переменной делится (без астатка)   |
и на 3, и на 4.                             |

int a;
if(a%3==0 && a%4==0)

------------------------------------------------------------------------
Значение переменной - четное,               |
но не заканчивается на О                    |

int a;
int a1 = a%10;
if(a%2==0 && a1!==0)
------------------------------------------------------------------------
Значение переменной делится на 3,           |
но не делится на 4.                         |

int a;
if(a%3 ==0 && a%4 != 0)

------------------------------------------------------------------------
Значение переменной делится на 5            |
с остаткам 2, а на 3 делится с остатком.    |

int a;
if(a%5 == 2 && a%3 != 0)

------------------------------------------------------------------------
Одна из цифр двузначного целого числа       |
(значения переменной) равна 3.              |

int a;
int a10 = a/10;
int a1 = a%10;
if(a10 % 3 == 0 || a1%3 == 0)

------------------------------------------------------------------------
Значение переменной представляет собой      |
«правильную» оценку.                        |

// himikva dprocum chgitwm chisht gnahatakan@ qanisica sksvum, gitem vor max.-@ 10 e, sksum em 1-ic

int a;
if(a>=1 && a<= 10)
------------------------------------------------------------------------
Ученик получил как минимум 4                |
и по английскому, и по математике.          |

int angl;
int mat;
if (angl >= 4 && angl <=10 && mat>= 4 && mat <= 10)

 */

public class Exercies9_3 {
}
