package com.demo.progresstests.exercies2;
/*
Напишите класс, который присваивает двум переменным значения,
а затем выводит на экран: в первой строке значения обеих переменных (с поясняющими надписями),
во второй - произведение этих переменных (с поясняющей надписью),
в третьей - сумму этих переменных (с поясняющей надписью).
 */

public class Exercies2_5 {
    public static void main(String[] args) {
        int a = 5;
        int b = 7;
        System.out.println("a = " + a + "; b = " + b);
        System.out.println(" ayd tveri gumar@ klini a + b = " + (a + b));
    }
}
