package com.demo.progresstests.exercies2;
/*
Напишите класс, который присваивает переменной х значение 9,
а затем выводит на экран: в первой строке - это значение с поясняющей надписью
(например, «значение х равно 9»),
а во второй - квадрат этого значения (тоже с поясняющей надписью).
 */

public class Exercies2_4 {
    public static void main(String[] args) {
        int x = 9;
        System.out.println("x-i arjeq@ havasar e " + x);
        System.out.println("x-i arjeq@ havasar e " + (x * x));

    }
}
