package com.demo.progresstests.exercies2;
/*
2.11
Напишите класс, который принимает с клавиатуры два целых числа и
выводит на экран следующие значения (каждое в отдельной строке):
сумму введенных чисел, их произведение, разницу между первым и вторым,
разницу между вторым и первым.
 */

public class Exercies2_11 {
    public static void main(String[] args) {
        int a = 13;
        int b = 7;
        System.out.println(" a + b = " + (a + b));
        System.out.println(" a * b = " + (a * b));
        System.out.println(" a - b = " + (a - b));
        System.out.println(" b - a = " + (b - a));
    }
}
