package com.demo.progresstests.exercies2;
/*
Напишите класс, который принимает с клавиатуры целое число
и затем выводит на экран его квадрат и его же куб, а между ними знак &.
 */

public class Exercies2_8 {
    public static void main(String[] args) {
        int a = 12;
        System.out.println((a * a) + " & " + (a * a * a));
    }
}
