package com.demo.progresstests.exercies2;
/*
Напишите класс, который принимает с клавиатуры целое число и выводит на экран число,
которое больше введенного с клавиатуры на 10.
 */

public class Exercies2_6 {
    public static void main(String[] args) {
        // miguce xndir@ sxal em haskacel, mtacum eyi menak 1-in tarberak@ grem heriqa, dra hamar navsyaki 2-rdn el greci
        //1-in tarberak
        //int x = 7;
        //System.out.println(" x = " + (x +10));

        // 2-rd tarberak
        exerciesDemo(5);
    }
    private static void exerciesDemo(int x){
        System.out.println(" x = " + (x + 10));

    }
}
