package com.demo.progresstests.exercies2;
/*
2.10
Напишите класс, который принимает с клавиатуры целое число
и выводит на экран следующие значения (каждое в отдельной строке): снова введенное число
и число, противоположное введенному числу.
 */

public class Exercies2_10 {
    public static void main(String[] args) {
        int a = 17;
        System.out.println(+a);
        System.out.println(+(-a));
    }
}
