package com.demo.progresstests.exercies18;
/*
Укажите, какие значения будет содержать массив, после выполнения следующего блока
(данные, вводимые с клавиатуры, выберите самостоятельно, используйте таблицу трассировки):
   n = 5;
for(int i = O; i < n / 2; i++) {
    x = reader.nextInt();
    a[i] = x;
    a[n - 1 - i] = a[i];
}
 */

public class Exercies18_8 {

    // x = 34;
    // a[0] = 34;
    // n - 1 - i = 5 - 1 - 0 = 4
    // a[4] = 34;

    // x = 27;
    // a[1] = 27;
    // n - 1 - i = 5 - 1 - 1 = 3;
    // a[3] = 27;

    // x = 45;
    // a[2] = 45;
    // n - 1 -i = 5 -1 - 2 = 2;
    // a[2] = 45;
}
