package com.demo.progresstests.exercies1;
/*
Напишите фрагмент класса, который присваивает переменной х целочисленное значение,
а затем присваивает переменной у треть от значения переменной х.
 */

public class Exercise1_7 {
    public static void main(String[] args) {
        double x = 14.0;
        double y = x / 3;
        System.out.println(" y = " + y);

    }
}
